%--------------------------------------------------------------------------
%  exampA.1-1  基于图像资料的数据重建与拟合
%--------------------------------------------------------------------------
% CopyRight：xiezhh

%*******************************读取图像数据********************************
IM = imread('exampA_1.bmp');
whos  IM


%********************************去除坐标框*********************************
Red = IM(:,:,1);
Rrow = sum(Red,2);
[a,idrow] = unique(Rrow);
idrow = idrow(1:2)

Rcol = sum(Red);
[b,idcol] = unique(Rcol);
idcol = idcol(1:2)

% 提取坐标框内部的图像数据
I = IM(min(idrow):max(idrow),min(idcol):max(idcol),:);
m = size(I, 1)
n = size(I, 2)

imshow(I)


%**************************提取图中曲线上点的像素坐标************************
BluePoints = (I(:,:,1) == 0 & I(:,:,2) == 0 & I(:,:,3) == 255);
[ypixel,xpixel] = find(BluePoints);
size(xpixel) 


%**************************将像素坐标转换为实际坐标**************************
x_xishu = 1/(n-1);
y_xishu = 9/(m-1);
xreal = (xpixel-1)*x_xishu;
yreal = -11-(ypixel-1)*y_xishu;


%**********************************曲线拟合*********************************
fun = @(a,x)[a(1)+a(2)/2*(x-0.17).^2+a(3)/4*(x-0.17).^4];
a = nlinfit(xreal,yreal,fun,[0, 0, 0])


%*******************************绘制重建的曲线******************************
yp = fun(a, xreal);
plot(xreal,yp);
xlabel('X');
ylabel('Y = f(X)');
text('Interpreter','latex',...
	'String',['$$-19.6749+\frac{22.2118}{2}(x-0.17)^2'...
    '+\frac{5.0905}{4}(x-0.17)^4$$'],'Position',[0.05, -12],...
	'FontSize',12);